def binary_search(lst, n):# Функция двоичного поиска. Возвращает индекс элемента, меньшего n, и следующего за ним большего или равного n
    left, right = 0, len(lst) - 1
    while left <= right:
        mid = (left + right) // 2
        if lst[mid] < n:
            left = mid + 1
        elif lst[mid] > n:
            right = mid - 1
        else:
            return mid
    return left



input_str = input("Введите последовательность чисел через пробел: ") # Считываем входные данные
n = input("Введите любое число: ")


if not all(map(str.isdigit, input_str.split())): # Проверяем, что все элементы входной строки являются числами
    print("Ошибка: в последовательности есть нечисловые элементы")
else:

    lst = list(map(int, input_str.split()))  # Преобразуем входную строку в список чисел

    lst.sort()  # Сортируем список по возрастанию

    pos = binary_search(lst, int(n)) # Ищем позицию элемента, меньшего n, и следующего за ним большего или равного n

    if pos < len(lst):  # Проверяем, что такой элемент есть в списке
        print(f"Позиция элемента: {pos}")
        print(f"Значение элемента: {lst[pos]}")
    else:
        print("Ошибка: в последовательности нет элементов, больших или равных введенному числу")
